# datetime 오브젝트

In [13]:
from datetime import datetime
import pandas as pd

In [5]:
# 현재시간
now = datetime.now()
today = datetime.today()
print(now)
print(today)

2022-10-05 09:17:30.489679
2022-10-05 09:17:30.489680

In [6]:
now

datetime.datetime(2022, 10, 5, 9, 17, 30, 489679)

In [8]:
print( datetime(1997,1,1,1,1,1) )

1997-01-01 01:01:01

In [11]:
print(now - datetime(1997,12,8))

9067 days, 9:17:30.489679

# 오브젝트로 변환

In [14]:
ebola = pd.read_csv('data/country_timeseries.csv')

In [17]:
ebola['date_dt'] = pd.to_datetime(ebola['Date'])
ebola.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 122 entries, 0 to 121
Data columns (total 19 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   Date                 122 non-null    object
 1   Day                  122 non-null    int64
 2   Cases_Guinea         93 non-null     float64
 3   Cases_Liberia        83 non-null     float64
 4   Cases_SierraLeone    87 non-null     float64
 5   Cases_Nigeria        38 non-null     float64
 6   Cases_Senegal        25 non-null     float64
 7   Cases_UnitedStates   18 non-null     float64
 8   Cases_Spain          16 non-null     float64
 9   Cases_Mali           12 non-null     float64
 10  Deaths_Guinea        92 non-null     float64
 11  Deaths_Liberia       81 non-null     float64
 12  Deaths_SierraLeone   87 non-null     float64
 13  Deaths_Nigeria       38 non-null     float64
 14  Deaths_Senegal       22 non-null     float64
 15  Deaths_UnitedStates  18 non-null     float64
 16  Deaths_Spain         16 non-null     float64
 17  Deaths_Mali          12 non-null     float64
 18  date_dt              122 non-null    datetime64[ns]
dtypes: datetime64[ns](1), float64(16), int64(1), object(1)
memory usage: 18.2+ KB

In [22]:
# 년월일 위치
# '%d/%m/%y/%H/%S/%M/%w'
# w 요일

now.strftime('%d/%m/%y/%H/%S/%M/%w')

'05/10/22/09/30/17/3'

In [24]:
# 오브젝트 변환
ebola1 = pd.read_csv('data/country_timeseries.csv',parse_dates=['Date'])
ebola1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 122 entries, 0 to 121
Data columns (total 18 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   Date                 122 non-null    datetime64[ns]
 1   Day                  122 non-null    int64
 2   Cases_Guinea         93 non-null     float64
 3   Cases_Liberia        83 non-null     float64
 4   Cases_SierraLeone    87 non-null     float64
 5   Cases_Nigeria        38 non-null     float64
 6   Cases_Senegal        25 non-null     float64
 7   Cases_UnitedStates   18 non-null     float64
 8   Cases_Spain          16 non-null     float64
 9   Cases_Mali           12 non-null     float64
 10  Deaths_Guinea        92 non-null     float64
 11  Deaths_Liberia       81 non-null     float64
 12  Deaths_SierraLeone   87 non-null     float64
 13  Deaths_Nigeria       38 non-null     float64
 14  Deaths_Senegal       22 non-null     float64
 15  Deaths_UnitedStates  18 non-null     float64
 16  Deaths_Spain         16 non-null     float64
 17  Deaths_Mali          12 non-null     float64
dtypes: datetime64[ns](1), float64(16), int64(1)
memory usage: 17.3 KB

In [26]:
ebola1['Date'][0].year

2015

In [28]:
ebola['date_dt'] = pd.to_datetime(ebola['Date'])
# 접근자 dt
ebola['year'] = ebola['date_dt'].dt.year
ebola['month']  = ebola['date_dt'].dt.month
ebola['day']  = ebola['date_dt'].dt.day
ebola[['Date','date_dt','year','month','day']]

           Date    date_dt  year  month  day
0      1/5/2015 2015-01-05  2015      1    5
1      1/4/2015 2015-01-04  2015      1    4
2      1/3/2015 2015-01-03  2015      1    3
3      1/2/2015 2015-01-02  2015      1    2
4    12/31/2014 2014-12-31  2014     12   31
..          ...        ...   ...    ...  ...
117   3/27/2014 2014-03-27  2014      3   27
118   3/26/2014 2014-03-26  2014      3   26
119   3/25/2014 2014-03-25  2014      3   25
120   3/24/2014 2014-03-24  2014      3   24
121   3/22/2014 2014-03-22  2014      3   22

[122 rows x 5 columns]

In [29]:
ebola['date_dt'].min()

Timestamp('2014-03-22 00:00:00')

In [31]:
ebola.loc[ebola['date_dt']==ebola['date_dt'].min()]

,Date,Day,Cases_Guinea,Cases_Liberia,Cases_SierraLeone,Cases_Nigeria,Cases_Senegal,Cases_UnitedStates,Cases_Spain,Cases_Mali,...,Deaths_SierraLeone,Deaths_Nigeria,Deaths_Senegal,Deaths_UnitedStates,Deaths_Spain,Deaths_Mali,date_dt,year,month,day
121,3/22/2014,0,49.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,2014-03-22,2014,3,22

In [32]:
ebola['date_dt']-ebola['date_dt'].min()

0     289 days
1     288 days
2     287 days
3     286 days
4     284 days
        ...
117     5 days
118     4 days
119     3 days
120     2 days
121     0 days
Name: date_dt, Length: 122, dtype: timedelta64[ns]